In [1]:
# This is a List
person = {
    "first" : "Corey",
    "last" : "Schafer",
    "email" : "CoreyMSchafer@gmail.com"
}

In [2]:
#This is a Dictionary
people = {
    "first" : ["Corey"], #Opening the brackets is mentioned as list is there
    "last" : ["Schafer"],
    "email" : ["CoreyMSchafer@gmail.com"]
}

In [3]:
#This is a Dictionary with more values
people = {
    "first" : ["Corey", 'Jane', 'John'],
    "last" : ["Schafer", 'Doe', 'Doe'],
    "email" : ["CoreyMSchafer@gmail.com", 'JaneDoe@gmail.com', 'JohnDoe@gmail.com']
}

In [4]:
import pandas as pd

In [5]:
df = pd.DataFrame(people)

In [6]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [7]:
df[['last', 'email']] #accesing to a list of 2 columns, making double brackets to identify that it's not only only column

      last                    email
0  Schafer  CoreyMSchafer@gmail.com
1      Doe        JaneDoe@gmail.com
2      Doe        JohnDoe@gmail.com

In [8]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [9]:
df.iloc[[0, 1]] #iloc = integers locations

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com

In [10]:
df.iloc[[0, 1], 2] #selecting 3rd column

0    CoreyMSchafer@gmail.com
1          JaneDoe@gmail.com
Name: email, dtype: object

In [11]:
df.loc[[0, 1], 'email']

0    CoreyMSchafer@gmail.com
1          JaneDoe@gmail.com
Name: email, dtype: object

In [12]:
df.loc[[0, 1], ['email', 'last']]

                     email     last
0  CoreyMSchafer@gmail.com  Schafer
1        JaneDoe@gmail.com      Doe

In [13]:
df.set_index('email') #set email column as index column

                         first     last
email
CoreyMSchafer@gmail.com  Corey  Schafer
JaneDoe@gmail.com         Jane      Doe
JohnDoe@gmail.com         John      Doe

In [14]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [15]:
df.set_index('email', inplace = True)

In [16]:
df

                         first     last
email
CoreyMSchafer@gmail.com  Corey  Schafer
JaneDoe@gmail.com         Jane      Doe
JohnDoe@gmail.com         John      Doe

In [17]:
df.loc['CoreyMSchafer@gmail.com'] #locating index column with row id as 'CoreyMSchafer@gmail.com'

first      Corey
last     Schafer
Name: CoreyMSchafer@gmail.com, dtype: object

In [18]:
df.loc['CoreyMSchafer@gmail.com', 'last']

'Schafer'

In [19]:
#reset index
df.reset_index(inplace=True)

In [20]:
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JohnDoe@gmail.com   John      Doe

In [21]:
df['last'] == 'Doe' #meet or not filtered mask criteria

0    False
1     True
2     True
Name: last, dtype: bool

In [22]:
#defining a filter
filt = (df['last'] == 'Doe')

In [23]:
df[filt]

               email first last
1  JaneDoe@gmail.com  Jane  Doe
2  JohnDoe@gmail.com  John  Doe

In [24]:
df.loc[filt] #same result

               email first last
1  JaneDoe@gmail.com  Jane  Doe
2  JohnDoe@gmail.com  John  Doe

In [25]:
df.loc[filt, 'email'] #filtered values from column email

1    JaneDoe@gmail.com
2    JohnDoe@gmail.com
Name: email, dtype: object

In [26]:
#defining a filter with 2 conditions and (&) or (|)
filt = (df['last'] == 'Schafer') | (df['first'] == 'John')

In [27]:
df.loc[~filt, 'email'] #negate the filter

1    JaneDoe@gmail.com
Name: email, dtype: object

In [28]:
df.columns

Index(['email', 'first', 'last'], dtype='object')

In [29]:
#changing column titles to capital letters
df.columns = [x.upper() for x in df.columns]
#changing column titles to lower letters : df.columns = [x.lower() for x in df.columns]
df

                     EMAIL  FIRST     LAST
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@gmail.com   Jane      Doe
2        JohnDoe@gmail.com   John      Doe

In [30]:
df.columns = ['email', 'first_name', 'last_name']
df

                     email first_name last_name
0  CoreyMSchafer@gmail.com      Corey   Schafer
1        JaneDoe@gmail.com       Jane       Doe
2        JohnDoe@gmail.com       John       Doe

In [31]:
#Replace column titles' underscore for space
df.columns = df.columns.str.replace('_', ' ')
df

                     email first name last name
0  CoreyMSchafer@gmail.com      Corey   Schafer
1        JaneDoe@gmail.com       Jane       Doe
2        JohnDoe@gmail.com       John       Doe

In [32]:
#change column titles - mapping names
df.rename(columns={'email':'mail', 'first_name':'first', 'last_name':'last'}, inplace=True)

In [33]:
df

                      mail first name last name
0  CoreyMSchafer@gmail.com      Corey   Schafer
1        JaneDoe@gmail.com       Jane       Doe
2        JohnDoe@gmail.com       John       Doe

In [34]:
df

                      mail first name last name
0  CoreyMSchafer@gmail.com      Corey   Schafer
1        JaneDoe@gmail.com       Jane       Doe
2        JohnDoe@gmail.com       John       Doe

In [35]:
#Changing values to lower case from a specific column
df['mail'] = df['mail'].str.lower()

In [36]:
df

                      mail first name last name
0  coreymschafer@gmail.com      Corey   Schafer
1        janedoe@gmail.com       Jane       Doe
2        johndoe@gmail.com       John       Doe

In [37]:
df['mail'].apply(len) #Gets the number of characters of every value in a specific column

0    23
1    17
2    17
Name: mail, dtype: int64

In [38]:
#returns all values in upper case with an apply function
def update_mail(mail):
    return mail.upper()

In [39]:
df['mail'].apply(update_mail) #applying the 'apply' function

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@GMAIL.COM
2          JOHNDOE@GMAIL.COM
Name: mail, dtype: object

In [40]:
df['mail'] = df['mail'].apply(update_mail) #modifying the df with the cappital letters on mail column

In [41]:
df

                      mail first name last name
0  COREYMSCHAFER@GMAIL.COM      Corey   Schafer
1        JANEDOE@GMAIL.COM       Jane       Doe
2        JOHNDOE@GMAIL.COM       John       Doe

In [42]:
#reverting to lower case using an apply function with lambda function which is an anonymous function
df['mail'] = df['mail'].apply(lambda x: x.lower())

In [43]:
df

                      mail first name last name
0  coreymschafer@gmail.com      Corey   Schafer
1        janedoe@gmail.com       Jane       Doe
2        johndoe@gmail.com       John       Doe

In [44]:
df['mail'] = df['mail'].apply(lambda x: x.upper()) # converting it to upper case again

In [45]:
df

                      mail first name last name
0  COREYMSCHAFER@GMAIL.COM      Corey   Schafer
1        JANEDOE@GMAIL.COM       Jane       Doe
2        JOHNDOE@GMAIL.COM       John       Doe

In [46]:
df.apply(len) #this will give the number of values for every column, i.e. mail column has 3 emails listed

mail          3
first name    3
last name     3
dtype: int64

In [47]:
len(df['mail']) #getting the number of values of a specific column

3

In [48]:
df.apply(len, axis='columns') #this will give the number of values for every row, i.e. row 0 has a name, a last name and a mail

0    3
1    3
2    3
dtype: int64

In [49]:
df.apply(pd.Series.min) #gives the minimun value for numbers and the first alphabetic value for strings for every column

mail          COREYMSCHAFER@GMAIL.COM
first name                      Corey
last name                         Doe
dtype: object

In [50]:
df.apply(lambda x: x.min()) #gives the minimun value for every column applying lambda function

mail          COREYMSCHAFER@GMAIL.COM
first name                      Corey
last name                         Doe
dtype: object

In [51]:
df.applymap(len) #gives the length of every cell of the df

   mail  first name  last name
0    23           5          7
1    17           4          3
2    17           4          3

In [52]:
df.applymap(str.lower) #converting all string values to lower caser, will not work on numbers

                      mail first name last name
0  coreymschafer@gmail.com      corey   schafer
1        janedoe@gmail.com       jane       doe
2        johndoe@gmail.com       john       doe

In [53]:
df

                      mail first name last name
0  COREYMSCHAFER@GMAIL.COM      Corey   Schafer
1        JANEDOE@GMAIL.COM       Jane       Doe
2        JOHNDOE@GMAIL.COM       John       Doe

In [54]:
#map works only for Series, in this case we are changing/substituting a couple of names of a column but will have to go
# for every value in the series, i.e. last value will remain as NaN
df['first name'].map({'Corey':'Chris', 'Jane':'Mary'})

0    Chris
1     Mary
2      NaN
Name: first name, dtype: object

In [55]:
#to subsitute specific values we use replace function, this will keep John in the name
df['first name'].replace({'Corey':'Chris', 'Jane':'Mary'})

0    Chris
1     Mary
2     John
Name: first name, dtype: object

In [56]:
df['first name'] = df['first name'].replace({'Corey':'Chris', 'Jane':'Mary'}) #applying the function to the df[column]

In [57]:
df

                      mail first name last name
0  COREYMSCHAFER@GMAIL.COM      Chris   Schafer
1        JANEDOE@GMAIL.COM       Mary       Doe
2        JOHNDOE@GMAIL.COM       John       Doe

In [58]:
#Adding columns, combining first and last name in an additional column
df['first name'] + ' ' + df['last name']

0    Chris Schafer
1         Mary Doe
2         John Doe
dtype: object

In [59]:
df['full name'] = df['first name'] + ' ' + df['last name'] #declaring the new column

In [60]:
df

                      mail first name last name      full name
0  COREYMSCHAFER@GMAIL.COM      Chris   Schafer  Chris Schafer
1        JANEDOE@GMAIL.COM       Mary       Doe       Mary Doe
2        JOHNDOE@GMAIL.COM       John       Doe       John Doe

In [61]:
#Removing columns
df.drop(columns=['first name', 'last name'], inplace=True)

In [62]:
df

                      mail      full name
0  COREYMSCHAFER@GMAIL.COM  Chris Schafer
1        JANEDOE@GMAIL.COM       Mary Doe
2        JOHNDOE@GMAIL.COM       John Doe

In [63]:
#Split a column when there is a space in the string value
df['full name'].str.split(' ')

0    [Chris, Schafer]
1         [Mary, Doe]
2         [John, Doe]
Name: full name, dtype: object

In [64]:
#Split a column when there is a space in the string value and spliting it into 2 different columns
df['full name'].str.split(' ', expand = True)

       0        1
0  Chris  Schafer
1   Mary      Doe
2   John      Doe

In [65]:
#giving the name to the splitted columns and assigning it to the df
df[['first', 'last']] = df['full name'].str.split(' ', expand = True)

In [66]:
df

                      mail      full name  first     last
0  COREYMSCHAFER@GMAIL.COM  Chris Schafer  Chris  Schafer
1        JANEDOE@GMAIL.COM       Mary Doe   Mary      Doe
2        JOHNDOE@GMAIL.COM       John Doe   John      Doe

In [67]:
#df.drop(columns=['first name'], inplace=True)

In [68]:
df

                      mail      full name  first     last
0  COREYMSCHAFER@GMAIL.COM  Chris Schafer  Chris  Schafer
1        JANEDOE@GMAIL.COM       Mary Doe   Mary      Doe
2        JOHNDOE@GMAIL.COM       John Doe   John      Doe

In [69]:
#Adding rows with the name Tony in the 'first' column, you have to ignore index
df.append({'first':'Tony'}, ignore_index=True)

C:\Users\RicardoEspinosa\AppData\Local\Temp\ipykernel_2928\162999231.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first':'Tony'}, ignore_index=True)

                      mail      full name  first     last
0  COREYMSCHAFER@GMAIL.COM  Chris Schafer  Chris  Schafer
1        JANEDOE@GMAIL.COM       Mary Doe   Mary      Doe
2        JOHNDOE@GMAIL.COM       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

In [70]:
#Appending 2 data frames
#declaring second df
people2 = {
    "first" : ["Tony", 'Steve'],
    "last" : ["Stark", 'Rogers'],
    "mail" : ["Ironman@gmail.com", 'cap@gmail.com']
}
df2 = pd.DataFrame(people2)

In [71]:
df2

   first    last               mail
0   Tony   Stark  Ironman@gmail.com
1  Steve  Rogers      cap@gmail.com

In [72]:
df.append(df2, ignore_index=True) #ignoring the sort of columns

C:\Users\RicardoEspinosa\AppData\Local\Temp\ipykernel_2928\3484908519.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2, ignore_index=True) #ignoring the sort of columns

                      mail      full name  first     last
0  COREYMSCHAFER@GMAIL.COM  Chris Schafer  Chris  Schafer
1        JANEDOE@GMAIL.COM       Mary Doe   Mary      Doe
2        JOHNDOE@GMAIL.COM       John Doe   John      Doe
3        Ironman@gmail.com            NaN   Tony    Stark
4            cap@gmail.com            NaN  Steve   Rogers

In [73]:
df.append(df2, ignore_index=True, sort=False) #ignoring the sort of columns

C:\Users\RicardoEspinosa\AppData\Local\Temp\ipykernel_2928\2836492242.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2, ignore_index=True, sort=False) #ignoring the sort of columns

                      mail      full name  first     last
0  COREYMSCHAFER@GMAIL.COM  Chris Schafer  Chris  Schafer
1        JANEDOE@GMAIL.COM       Mary Doe   Mary      Doe
2        JOHNDOE@GMAIL.COM       John Doe   John      Doe
3        Ironman@gmail.com            NaN   Tony    Stark
4            cap@gmail.com            NaN  Steve   Rogers

In [74]:
df = df.append(df2, ignore_index=True, sort=False)

C:\Users\RicardoEspinosa\AppData\Local\Temp\ipykernel_2928\3370980109.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2, ignore_index=True, sort=False)

In [75]:
df

                      mail      full name  first     last
0  COREYMSCHAFER@GMAIL.COM  Chris Schafer  Chris  Schafer
1        JANEDOE@GMAIL.COM       Mary Doe   Mary      Doe
2        JOHNDOE@GMAIL.COM       John Doe   John      Doe
3        Ironman@gmail.com            NaN   Tony    Stark
4            cap@gmail.com            NaN  Steve   Rogers

In [76]:
#Removing from the column index, index 4
df.drop(index=4)

                      mail      full name  first     last
0  COREYMSCHAFER@GMAIL.COM  Chris Schafer  Chris  Schafer
1        JANEDOE@GMAIL.COM       Mary Doe   Mary      Doe
2        JOHNDOE@GMAIL.COM       John Doe   John      Doe
3        Ironman@gmail.com            NaN   Tony    Stark

In [77]:
#drop rows which contain last name of 'Doe'
df.drop(index=df[df['last'] == 'Doe'].index)

                      mail      full name  first     last
0  COREYMSCHAFER@GMAIL.COM  Chris Schafer  Chris  Schafer
3        Ironman@gmail.com            NaN   Tony    Stark
4            cap@gmail.com            NaN  Steve   Rogers

In [78]:
#easier to read
filt = df['last'] == 'Doe'
df.drop(index=df[filt].index)

                      mail      full name  first     last
0  COREYMSCHAFER@GMAIL.COM  Chris Schafer  Chris  Schafer
3        Ironman@gmail.com            NaN   Tony    Stark
4            cap@gmail.com            NaN  Steve   Rogers

In [79]:
#Sort Data by a specific column
df.sort_values(by='last')

                      mail      full name  first     last
1        JANEDOE@GMAIL.COM       Mary Doe   Mary      Doe
2        JOHNDOE@GMAIL.COM       John Doe   John      Doe
4            cap@gmail.com            NaN  Steve   Rogers
0  COREYMSCHAFER@GMAIL.COM  Chris Schafer  Chris  Schafer
3        Ironman@gmail.com            NaN   Tony    Stark

In [80]:
df.sort_values(by='last', ascending=False) #order in descending

                      mail      full name  first     last
3        Ironman@gmail.com            NaN   Tony    Stark
0  COREYMSCHAFER@GMAIL.COM  Chris Schafer  Chris  Schafer
4            cap@gmail.com            NaN  Steve   Rogers
1        JANEDOE@GMAIL.COM       Mary Doe   Mary      Doe
2        JOHNDOE@GMAIL.COM       John Doe   John      Doe

In [81]:
df.sort_values(by=['last', 'first'], ascending=False) #sorting in descending 2 columns, for last names repeated

                      mail      full name  first     last
3        Ironman@gmail.com            NaN   Tony    Stark
0  COREYMSCHAFER@GMAIL.COM  Chris Schafer  Chris  Schafer
4            cap@gmail.com            NaN  Steve   Rogers
1        JANEDOE@GMAIL.COM       Mary Doe   Mary      Doe
2        JOHNDOE@GMAIL.COM       John Doe   John      Doe

In [82]:
df.sort_values(by=['last', 'first'], ascending=[False, True], inplace=True) #sorting in descending column 'last', and in ascending column 'first'

In [83]:
df

                      mail      full name  first     last
3        Ironman@gmail.com            NaN   Tony    Stark
0  COREYMSCHAFER@GMAIL.COM  Chris Schafer  Chris  Schafer
4            cap@gmail.com            NaN  Steve   Rogers
2        JOHNDOE@GMAIL.COM       John Doe   John      Doe
1        JANEDOE@GMAIL.COM       Mary Doe   Mary      Doe

In [84]:
df.sort_index()

                      mail      full name  first     last
0  COREYMSCHAFER@GMAIL.COM  Chris Schafer  Chris  Schafer
1        JANEDOE@GMAIL.COM       Mary Doe   Mary      Doe
2        JOHNDOE@GMAIL.COM       John Doe   John      Doe
3        Ironman@gmail.com            NaN   Tony    Stark
4            cap@gmail.com            NaN  Steve   Rogers

In [85]:
df['last'].sort_values() #Taking values from column 'last' in ascending order

2        Doe
1        Doe
4     Rogers
0    Schafer
3      Stark
Name: last, dtype: object

In [86]:
import numpy as np

In [87]:
people3 = {
    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'], 
    'last': ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}

In [89]:
df_people3 = pd.DataFrame(people3)

In [90]:
df_people3

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [91]:
#removing NAs

In [92]:
df_people3.dropna()

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
6     NA  Missing                       NA  Missing

In [93]:
#default drop NA: what is doing in the background... same result... removing all columns containing any NA/None values
df_people3.dropna(axis='index', how='any')

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
6     NA  Missing                       NA  Missing

In [95]:
df_people3.dropna(axis='index', how='all') # when an entire row has NA/None values in all cells

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [96]:
df_people3.dropna(axis='columns', how='all') # when an entire column has NA/None values in all cells

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [97]:
#Dropping any column that doesn't have an email in the email column
df_people3.dropna(axis='index', how='any', subset=['email'])

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [103]:
#as long as at least last name or email are there... use ALL
df_people3.dropna(axis='index', how='all', subset=['last', 'email'])

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [106]:
#Replacing 'NA's and 'Missing'swith replacing numpy function
df_people3.replace('NA', np.nan, inplace=True)
df_people3.replace('Missing', np.nan, inplace=True)

In [107]:
df_people3.dropna(axis='index', how='all', subset=['last', 'email'])

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
5   None      NaN      Anonymous@email.com  None

In [108]:
#Look at values NA at every cell
df_people3.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [109]:
#Fill NA values with 'MISSING' string
df_people3.fillna('MISSING')

     first     last                    email      age
0    Corey  Schafer  CoreyMSchafer@gmail.com       33
1     Jane      Doe        JaneDoe@email.com       55
2     John      Doe        JohnDoe@email.com       63
3    Chris  Schafer                  MISSING       36
4  MISSING  MISSING                  MISSING  MISSING
5  MISSING  MISSING      Anonymous@email.com  MISSING
6  MISSING  MISSING                  MISSING  MISSING

In [110]:
#Fill NA values with 0 string
df_people3.fillna(0)

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55
2   John      Doe        JohnDoe@email.com  63
3  Chris  Schafer                        0  36
4      0        0                        0   0
5      0        0      Anonymous@email.com   0
6      0        0                        0   0

In [111]:
#Get avg age with NA values... NA values are defined as float values in numpy lib
type(np.nan)

float

In [112]:
#if there are no values, just blanks, will have to convert them as floats, not int
#df_people3['age'] = df_people3['age'].astype(int)
df_people3['age'] = df_people3['age'].astype(float)

In [113]:
df_people3.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [114]:
df_people3['age'].mean()

46.75